<?php
//小于100可以被3整除的数,且个位数为6
for($num = 1; $num < 100; $num++) {
    if ($num % 3 == 0 && $num % 10 == 6) {
        echo $num." , ";
    }
}

//输出100以内的复数，并且以5个为一行打印出来
for($num=1,$c=0;$num<100;$num++){
    if($num%2==0){
        echo $num."  ";
        $c=$c+1;
    }
    if($c%5==0){
        echo "\n";
    }
}

//操场上100多人排队，3人一组多1人，4人一组多2人，5人一组多3人，共多少人？
for($num=100;$num<200;$num++){
    if($num%3==1&&$num%4==2&&$num%5==3){
        echo $num."\n";
    }
}

//两个自然数相除，商3余10，被除数、除数、商余数的和是163，求被除数，除数。
 for($i=1;$i<163;$i++){
     if($i*3+10+$i+3+10==163){
         echo "被除数：".'$i*3+10'."；"."除数：".$i."\n";
     }
 }

 //
// $num=100;
//  for($m=1;$m<=50;$m++){
//      if($num>50){
//          $num=$num-3;
//      }else{
//          $num=$num-1;
//      }
//  }
//  echo '每走'.$m.'米，'.'所剩香蕉数为'.$num."\n";

 //打印0-300不包含4的自然数
for($x=0;$x<3;$x++){
    for($y=0;$y<10;$y++){
        for($z=0;$z<10;$z++){
            if($x!=4&&$y!=4&&$z!=4){
                echo $x*100+$y*10+$z.",";
            }
        }
    }
}